app/controllers/api/v1/folders_controller.rb

SELECT "folders".* FROM "folders"
---
  def index
    @folders = Folder.includes(:parent_folder).all

INSERT INTO "folders" ("name", "main_folder_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "My Folder 2"], ["main_folder_id", nil], ["created_at", "2023-07-10 18:42:45.859951"], ["updated_at", "2023-07-10 18:42:45.859951"]]
---
  def create
    @folder = Folder.new(folder_params)

    if @folder.save

SELECT "archives".* FROM "archives" WHERE "archives"."folder_id" = $1  [["folder_id", "8303a40a-d6a2-40fe-9148-8abe97b67ec4"]]
SELECT "folders".* FROM "folders" WHERE "folders"."id" = $1 LIMIT $2  [["id", "7d3c4ade-169e-40a1-beb3-ff06f93c2ca3"], ["LIMIT", 1]]
---
    def set_folder
      @folder = Folder.with_attached_archives.includes(:child_folders).find(params[:id])